In [37]:
import pandas as pd
import psycopg2

from sqlalchemy import create_engine, text

In [2]:
conn_string = "host='db' dbname='postgres' user='postgres'"

In [3]:
conn = psycopg2.connect(conn_string)

In [4]:
cursor = conn.cursor()

In [8]:
!cd .. 
!ls

main.py  Test.ipynb

In [39]:
df = pd.read_csv('/home/jovyan/Data/Titanic/train.csv')

In [40]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
engine = create_engine('postgresql://postgres@db:5432/postgres')

In [28]:
#загружаем данные в postgres
df.to_sql('titanic_train', con=engine)

891

In [47]:
# читаем данные из postgres
with engine.begin() as conn:
    query = text("""
    SELECT * 
    FROM titanic_train
    """)
    df_pg = pd.read_sql_query(query, conn)

In [48]:
df_pg.head(5)

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S